#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизитыФормы();
	ВывестиОтчеты();
		
КонецПроцедуры  

#КонецОбласти       

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоследниеИзмененияОтображатьКоличествоПриИзменении(Элемент)
	ПоследниеИзмененияОтображатьКоличествоПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции    

#Область РаботаСреквизитамиФормы

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ПоследниеИзмененияОтображатьКоличество = 15;
	
КонецПроцедуры

#КонецОбласти

#Область ВыводОтчетов

&НаСервере
Процедура ВывестиОтчеты()
	
	ВывестиОтчетАнализРаботыПользователейСИнтеграциями();

КонецПроцедуры    

&НаСервере
Процедура ВывестиОтчетАнализРаботыПользователейСИнтеграциями()
	
	Отчет = Отчеты.АнализРаботыПользователейСИнтеграциями.Создать(); 
	Отчет.УстановитьКоличествоВыводимыхИнтеграций(ПоследниеИзмененияОтображатьКоличество);
	Отчет.СкомпоноватьРезультат(ТабДокПоследниеИзмененныеИнтеграции);  
	
КонецПроцедуры 

#КонецОбласти

&НаСервере
Процедура ПоследниеИзмененияОтображатьКоличествоПриИзмененииНаСервере()
	ВывестиОтчетАнализРаботыПользователейСИнтеграциями();
КонецПроцедуры

#КонецОбласти

