#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьРеквизитыФормы();
	ВывестиОтчеты();
		
КонецПроцедуры  

#КонецОбласти       

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоследниеИзмененияОтображатьКоличествоПриИзменении(Элемент)
	ПоследниеИзмененияОтображатьКоличествоПриИзмененииНаСервере();
КонецПроцедуры   

&НаКлиенте
Процедура НовыеИнтеграцииОтображатьКоличествоПриИзменении(Элемент)
	НовыеИнтеграцииОтображатьКоличествоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьКоличествоСистемПриИзменении(Элемент)
	ВыводитьКоличествоСистемПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборТехнологияИнтеграциииПриИзменении(Элемент)
	ОтборТехнологияИнтеграциииПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции    

#Область РаботаСреквизитамиФормы

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	
	ПоследниеИзмененияОтображатьКоличество = 5;
	НовыеИнтеграцииОтображатьКоличество = 5;
	ВыводитьКоличествоСистем = 10;
	
КонецПроцедуры

#КонецОбласти

#Область ВыводОтчетов

&НаСервере
Процедура ВывестиОтчеты()
	
	ВывестиОтчетАнализРаботыПользователейСИнтеграциями(); 
	ВывестиОтчетНовыеИнтеграции(); 
	ВывестиОтчетАнализИнтеграцийПоКоличеству();

КонецПроцедуры    

&НаСервере
Процедура ВывестиОтчетАнализИнтеграцийПоКоличеству()
	
	ТабДокАнализИнтеграцийПоКоличеству.Очистить();
	
	Отчет = Отчеты.АнализИнтеграцийПоКоличеству.Создать();
	Отчет.УстановитьТехнологиюИнтеграции(ОтборТехнологияИнтеграциии);
	Отчет.УстановитьКоличествоИС(ВыводитьКоличествоСистем);     
	Отчет.УстановитьИмяВыводимогоВарианта("РабочийСтолДиаграммаКоличествоПоИС");
	Отчет.СкомпоноватьРезультат(ТабДокАнализИнтеграцийПоКоличеству);  
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиОтчетАнализРаботыПользователейСИнтеграциями()
	
	ТабДокПоследниеИзмененныеИнтеграции.Очистить();
	
	Отчет = Отчеты.АнализРаботыПользователейСИнтеграциями.Создать();
	Отчет.УстановитьИмяВыводимогоВарианта("РабочийСтолПоследниеИзмененияПользователями");
	Отчет.УстановитьКоличествоВыводимыхИнтеграций(ПоследниеИзмененияОтображатьКоличество);
	Отчет.СкомпоноватьРезультат(ТабДокПоследниеИзмененныеИнтеграции);  
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиОтчетНовыеИнтеграции()
	
	ТабДокНовыеИнтеграции.Очистить();
	
	Отчет = Отчеты.АнализРаботыПользователейСИнтеграциями.Создать();
	Отчет.УстановитьИмяВыводимогоВарианта("РабочийСтолНовыеИнтеграции");
	Отчет.УстановитьКоличествоВыводимыхИнтеграций(НовыеИнтеграцииОтображатьКоличество);
	Отчет.СкомпоноватьРезультат(ТабДокНовыеИнтеграции);  
	              
КонецПроцедуры
			  
#КонецОбласти

&НаСервере
Процедура ПоследниеИзмененияОтображатьКоличествоПриИзмененииНаСервере()
	ВывестиОтчетАнализРаботыПользователейСИнтеграциями();
КонецПроцедуры

&НаСервере
Процедура НовыеИнтеграцииОтображатьКоличествоПриИзмененииНаСервере()
	ВывестиОтчетНовыеИнтеграции()
КонецПроцедуры

&НаСервере
Процедура ВыводитьКоличествоСистемПриИзмененииНаСервере()
	ВывестиОтчетАнализИнтеграцийПоКоличеству();
КонецПроцедуры  

&НаСервере
Процедура ОтборТехнологияИнтеграциииПриИзмененииНаСервере()
	ВывестиОтчетАнализИнтеграцийПоКоличеству();
КонецПроцедуры

#КонецОбласти

